[
  {
    "path": "posts/2021-02-08-greater-mekong/",
    "title": "The Climate-Water-Energy Nexus of the Greater Mekong Subregion",
    "description": "How climate influences a massive power system",
    "author": [],
    "date": "2021-02-17",
    "categories": [
      "water and energy"
    ],
    "contents": "\r\nA massive power grid, capacity 47.89 GW, connects Laos and Thailand, spanning the Mekong, Chao Phraya, and smaller river basins. This power grid is the subject of our recent work (Chowdhury et al. 2021), just published in Earth’s Future.\r\n\r\n\r\nThe Laos-Thailand power grid, encoded in the power system model PowNet (Chowdhury et al. 2020). Inset: the Mekong and Chao Phraya River Basins, modelled with VIC-Res (Dang et al. 2020).\r\n\r\n6.1 GW of capacity comes from hydropower, with 23 dams punctuating the river basins. Another 8.2 GW comes from thermal power plants that require river flow for cooling—during droughts, these plants have to be derated. In total, about 30% of installed capacity is dependent on freshwater supply from the rivers. These rivers are strongly influenced by climate. In particular, they tend to have low flow in El Niños and high flow in La Niñas. How do these variations affect the power system? Is it robust enough against climate?\r\nTo answer these questions, we modeled the system. We fixed its configuration as of 2016, and simulated it with 30 years of climate data, from 1976 to 2005. In other words, we simulate, hypothetically, how the current system would behave if it were to experience the climate of those recent 30 years.\r\nFirst, we modeled river discharge from climate inputs with the VIC-Res model (Dang et al. 2020). VIC-Res explicitly accounts for reservoirs, a critical component that is absent in most hydrological models. Having river discharges, we then determined the available capacity from the water-dependent plants. Next, we used a unit commitment model, PowNet (Chowdhury et al. 2020), to simulate hourly electricity dispatches to consumers. Thus, we were able to model the whole behavioral chain from the climatic inputs to the power outputs.\r\nWe found that indeed the system is strongly influenced by climate: during dry years (which often coincide with El Niños), there is less hydropower available, thermal power plants are derated, and consequently, productions are reduced.\r\n\r\n\r\nSystem behaviors in different climatic and hydrologic conditions. SDI: standardized streamflow index (z-score of the Box-Cox transformed flow). negative SDI indicates dry conditions (the lower the drier), and positive SDI indicates wet conditions (the higher the wetter). MK: Mekong. CPO: Chao Phraya and others.\r\n\r\nWhile these general behaviors are intuitive, only by modeling the system at high levels of details can we quantify the amount of climate impact. Less hydropower means more coal and gas, i.e., higher costs and more CO2 emission. We calculated that during droughts, power production costs increase by up to 120 million USD, and CO2 emission increases by up to 2.5 million tonnes compared to normal conditions. While the system can switch from one energy source to another, it has little buffer against climate in terms of cost and carbon footprint.\r\nOur simulations also reveal the spatial behavior of the system. Not all droughts are equal. When there are compound droughts in both the Mekong and the Chao Phraya, the system is more severely impacted. Why? Because the river basins are interlinked through the grid. And what’s interesting is that the grid flow in almost one direction: Thailand imports 90% of Laos’ electricity production from the Mekong, in addition to its own production from the Chao Phraya and other basins. This means that Thailand is particularly vulnerable to compound droughts. And we know that compound droughts had happened multiple times in the past eight centuries (Nguyen et al. 2020).\r\n\r\n\r\nExamples of system behavior in severe drought years.\r\n\r\nWe hope that our study has shed some more lights on the role and characteristics of reservoirs and power system (plants and grid) in the region, so that we can better manage them.\r\n\r\n\r\n\r\nChowdhury, A. F. M. Kamal, Thanh Duc Dang, Hung Tan Thai Nguyen, Rachel Koh, and Stefano Galelli. 2021. “The Greater Mekong’s Climate-Water-Energy Nexus: How ENSO-Triggered Regional Droughts Affect Power Supply and Co2 Emissions.” Earth’s Future, e2020EF001814. https://doi.org/https://doi.org/10.1029/2020EF001814.\r\n\r\n\r\nChowdhury, A. F. M. Kamal, Jordan Kern, Thanh Duc Dang, and Stefano Galelli. 2020. “PowNet: A Network-Constrained Unit Commitment/Economic Dispatch Model for Large-Scale Power Systems Analysis.” Journal of Open Research Software 8 (1): 5. https://doi.org/10.5334/jors.302.\r\n\r\n\r\nDang, Thanh Duc, Dung Trung Vu, A. F. M. Kamal Chowdhury, and Stefano Galelli. 2020. “A Software Package for the Representation and Optimization of Water Reservoir Operations in the VIC Hydrologic Model.” Environmental Modelling & Software 126 (April): 104673. https://doi.org/10.1016/j.envsoft.2020.104673.\r\n\r\n\r\nNguyen, Hung T. T., Sean W. D. Turner, Brendan M. Buckley, and Stefano Galelli. 2020. “Coherent Streamflow Variability in Monsoon Asia Over the Past Eight Centuries—Links to Oceanic Drivers.” Water Resources Research 56 (12). https://doi.org/10.1029/2020WR027883.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-08-greater-mekong/Figure_4.png",
    "last_modified": "2021-02-17T18:28:58+08:00",
    "input_file": {},
    "preview_width": 2400,
    "preview_height": 2223
  },
  {
    "path": "posts/2021-01-30-two-months-after-phd/",
    "title": "After PhD",
    "description": "Getting used to a new life stage",
    "author": [],
    "date": "2021-01-30",
    "categories": [
      "academic life"
    ],
    "contents": "\r\nIn the last two months of my PhD, I poured myself into coding, writing, and making presentations. I was moving at bullet speed. Then I passed my defense. Suddenly the bullet pierced through a wall and found itself without a target, disoriented. But it was impossible to stop.\r\nMy brain had been working so hard it couldn’t stop thinking. I had put off many research ideas to focus on the defense, and I wanted to get back to them. I knew that I was going to lose access to the computing clusters, so I wanted to ran them as much as possible. And there was AGU. But everyone around me was saying it was time for a break. My kids were screaming for my time. My house was screaming for a clean-up. And my wife was tired of doing most of the chores so that I could finish my thesis.\r\nI tried to slow down. I started by KonMari-ing the house. Then picking up the kids earlier from daycare to play with them. I brought them to the zoo and places. I made them a kitchen out of diaper cartons. Slowly, my brain winded down. I felt relaxed enough to go out on dates with my wife. It took me more than a month to find peace.\r\n\r\n\r\nThe kids in the zoo\r\n\r\nWhen I was OK with not sciencing, I picked up (once again) a new (old) hobby: inline skating. I skate once or twice a week, trying different parks in nearby neighbourhoods. I did the non-work things that I’ve always wanted to do: remake my website, start this blog, and update my CV. When I felt right, I resumed the weekly research meeting. We started slow, just tossing ideas around and brainstorming proposals. No serious science yet.\r\n\r\n\r\nThe kids’ kitchen, made out of diaper cartons\r\n\r\nThe second post-PhD month is now ending, and I am facing the opposite problem: my brain is not in science mode; I get distracted easily. But this seems to be an easier problem that will go away soon.\r\nFinishing a PhD is hard. As it turns out, having finished one is not easy either. Especially in a pandemic—I would have booked a trip somewhere if I could have. But as with most life stage transitions, it takes time. I’m still excited about what lies ahead.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-30-two-months-after-phd/zoo.jpg",
    "last_modified": "2021-01-28T15:51:25+08:00",
    "input_file": {}
  }
]
